package com.hillel.java;

/**
 3. Написать функцию делится ли число "a" на число "b" без остатка.
 */
public class Task3 {
  public static void main(String[] args) {
    int a = 0;
    int b = 0;
    if (a%b == 0){
      System.out.println("остатка нет");
    }else{
      System.out.println("остаток есть");
    }

  }
}

